In [1]:
import pandas as pd

In [62]:
df1=pd.DataFrame([['A',1,100],['B',2,200],['C',3,300],['D',4,400],['E',5,500],['F',6,600],['G',7,100],['H',8,200],['J',9,900],['J',10,1000],['E',11,1100],['I',12,1200]],columns=['Name','Roll_No','Marks'])
df1.to_csv('_dataset/Pandas.csv',index=False)

In [63]:
df2=pd.read_csv('_dataset/Pandas.csv',index_col ="Roll_No")
df2

        Name  Marks
Roll_No
1          A    100
2          B    200
3          C    300
4          D    400
5          E    500
6          F    600
7          G    100
8          H    200
9          J    900
10         J   1000
11         E   1100
12         I   1200

In [6]:
# Transpose
df.T

Roll_No   1    2    3    4    5    6    7    8    9     10    11    12
Name       A    B    C    D    E    F    G    H    J     J     E     I
Marks    100  200  300  400  500  600  100  200  900  1000  1100  1200

In [7]:
df.shape

(12, 2)

In [8]:
df.to_numpy()

array([['A', 100],
       ['B', 200],
       ['C', 300],
       ['D', 400],
       ['E', 500],
       ['F', 600],
       ['G', 100],
       ['H', 200],
       ['J', 900],
       ['J', 1000],
       ['E', 1100],
       ['I', 1200]], dtype=object)

In [9]:
df.describe()

             Marks
count    12.000000
mean    550.000000
std     403.394686
min     100.000000
25%     200.000000
50%     450.000000
75%     925.000000
max    1200.000000

In [10]:
df.head(3)

        Name  Marks
Roll_No
1          A    100
2          B    200
3          C    300

In [11]:
df.tail(3)

        Name  Marks
Roll_No
10         J   1000
11         E   1100
12         I   1200

# Column Operation

In [70]:
df3=pd.DataFrame([['a',1,500],['b',2,600],['c',3,700]],columns=['name','roll','marks'],index=['r1','r2','r3'])
df3

   name  roll  marks
r1    a     1    500
r2    b     2    600
r3    c     3    700

In [71]:
df3.columns

Index(['name', 'roll', 'marks'], dtype='object')

**Add Column**

In [72]:
df3.insert(0,'Subject',[1,2,3])
df3

    Subject name  roll  marks
r1        1    a     1    500
r2        2    b     2    600
r3        3    c     3    700

**Pop Columns**

In [73]:
df3.pop('Subject')

r1    1
r2    2
r3    3
Name: Subject, dtype: int64

**Delete Column**

In [74]:
df3.drop('marks',axis=1,inplace=True)
df3

   name  roll
r1    a     1
r2    b     2
r3    c     3

**Rename Columns**

In [76]:
df3.rename({'roll':'Roll No.','name':'Name'},axis=1,inplace=True)
df3

   Name  Roll No.
r1    a         1
r2    b         2
r3    c         3

## Index Operation

In [78]:
df3.rename({'r1':'1','r2':'2','r3':'3'},axis=0,inplace=True)
df3

  Name  Roll No.
1    a         1
2    b         2
3    c         3

In [79]:
df3.index

Index(['1', '2', '3'], dtype='object')

In [80]:
df.set_index('Roll No.')

         Name
Roll No.
1           a
2           b
3           c

## Column-Data Handling

In [92]:
df1

   Name  Roll_No  Marks
0     A        1    100
1     B        2    200
2     C        3    300
3     D        4    400
4     E        5    500
5     F        6    600
6     G        7    100
7     H        8    200
8     J        9    900
9     J       10   1000
10    E       11   1100
11    I       12   1200

In [82]:
print(len(df1.Name))
print(len(df1.Name.unique()))
df1.Name.unique()

12
10

array(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'J', 'I'], dtype=object)

In [83]:
df1.Marks.value_counts()

100     2
200     2
400     1
900     1
500     1
600     1
1100    1
300     1
1000    1
1200    1
Name: Marks, dtype: int64

In [85]:
a=df1[df1.Marks==200]
a.head()

  Name  Roll_No  Marks
1    B        2    200
7    H        8    200

In [86]:
a=df1[(df1.Marks==200) & (df1.Name=="B")]
a.head()

  Name  Roll_No  Marks
1    B        2    200

In [87]:
a=df1[df1.Marks>1000]
a.head()

   Name  Roll_No  Marks
10    E       11   1100
11    I       12   1200

In [88]:
# a=df[df.Roll_No.isin(range(4,9))]
a=df1[df1.index.isin(range(4,9))]
a.head()

  Name  Roll_No  Marks
4    E        5    500
5    F        6    600
6    G        7    100
7    H        8    200
8    J        9    900

**Each Element in row Operation**

In [21]:
names=df.Name
size=[]
for n in names:
    size.append(len(n))
size

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]

In [93]:
df1.Name.apply(len)

0     1
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    1
11    1
Name: Name, dtype: int64

In [94]:
df1.Name.map(len)

0     1
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    1
11    1
Name: Name, dtype: int64

### groupby() operation

In [96]:
tips=pd.read_csv('_dataset/tips.csv')
tips.head()

   total_bill   tip  gender smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [97]:
tips.groupby('day').total_bill.describe()

      count       mean       std   min      25%    50%      75%    max
day
Fri    19.0  17.151579  8.302660  5.75  12.0950  15.38  21.7500  40.17
Sat    87.0  20.441379  9.480419  3.07  13.9050  18.24  24.7400  50.81
Sun    76.0  21.410000  8.832122  7.25  14.9875  19.63  25.5975  48.17
Thur   62.0  17.682742  7.886170  7.51  12.4425  16.20  20.1550  43.11

In [98]:
tips.groupby('day').total_bill.min() #count,mean,std,min,max

day
Fri     5.75
Sat     3.07
Sun     7.25
Thur    7.51
Name: total_bill, dtype: float64

In [99]:
tips.groupby('day').agg(['min','max','mean','sum'])

     total_bill                              tip                           \
            min    max       mean      sum   min    max      mean     sum
day
Fri        5.75  40.17  17.151579   325.88  1.00   4.73  2.734737   51.96
Sat        3.07  50.81  20.441379  1778.40  1.00  10.00  2.993103  260.40
Sun        7.25  48.17  21.410000  1627.16  1.01   6.50  3.255132  247.39
Thur       7.51  43.11  17.682742  1096.33  1.25   6.70  2.771452  171.83

     size
      min max      mean  sum
day
Fri     1   4  2.105263   40
Sat     1   5  2.517241  219
Sun     2   6  2.842105  216
Thur    1   6  2.451613  152

In [100]:
tips.drop_duplicates()

     total_bill   tip  gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[243 rows x 7 columns]

### Remove NaN

In [103]:
df=pd.read_csv('https://github.com/ScriptShef/Dataset-Analysis/tree/main/Dataset/weather_data.txt')
df

ParserError: Error tokenizing data. C error: Expected 1 fields in line 72, saw 2

In [ ]:
df.notnull()

In [ ]:
df.notnull().sum()

In [ ]:
df.isnull()

In [95]:
df.isnull().sum()

# Drop all rows and columns containing NaN value
df.dropna()
df

# Drop all rows and columns containing entirely of NaN value
df.dropna(how = 'all')
df

db=df
# Drop the 6th index in the original 'data' since it has a NaN place
#db.dropna(inplace = True)

# Drop all rows that have more than 2 NaN values
df.dropna(thresh = 2)
df

# Drop all rows and columns containing entirely of NaN value
df.dropna(how = 'all')

# Drop only columns that contain entirely NaN value
# Default is 0 - which signifies rows
df.dropna(axis = 1, how = 'all')

# Filling in Missing Data

import pandas as pd
df=pd.read_csv('C:/Users/KunwarSunnySingh/Desktop/#Proj-Python/MLTutorial/dataset/weather_data.txt')
df

# Fill the NaN values with 0
df.fillna(0)

# Pass a dictionary to use differnt values for each column
df.fillna({'temperature':30,'windspeed':10,'event':'No event'})

df.fillna(method='ffill')

# Pass method to determine how to fill-up the column - forward here
df.fillna(method='ffill', limit = 2)


# Pass method to determine how to fill-up the row - forward here
df.fillna(axis = 1, method='ffill')
#df.ffill()

# Pass method to determine how to fill-up the row - forward here
df.fillna(axis = 1, method='bfill')
#df.bfill()

df.fillna(df.mean())


# Replacing Values

import pandas as pd
df=pd.read_csv('C:/Users/KunwarSunnySingh/Desktop/#Proj-Python/MLTutorial/dataset/weather_data2.txt')
df.head()


import numpy as np
#df.replace(-99999, np.nan)
df.replace({-99999:30,-88888:9})

df1=df.replace({'temperature':-99999},30)
df1=df1.replace({'windspeed':(-99999,-88888)},30)
df1

# Adding knowledge - Map Function

import pandas as pd
df=pd.read_csv('C:/Users/KunwarSunnySingh/Desktop/#Proj-Python/MLTutorial/dataset/weather_data2.txt')
df.head()


df.event.unique()

df['event']=df['event'].map({'Rain':1, 'Sunny':2, 'Snow':3, 'No event':4})
df

import pandas as pd
df=pd.read_csv('C:/Users/KunwarSunnySingh/Desktop/#Proj-Python/MLTutorial/dataset/weather_data2.txt')
df.head()

df1=df.pop('event')
df1=pd.get_dummies(df1)
pd.concat([df, df1], axis=1, join='inner')



# Remove Unit

import pandas as pd
df=pd.read_csv('C:/Users/KunwarSunnySingh/Desktop/#Proj-Python/MLTutorial/dataset/weather_data3.txt')
df

a=df
a=a.replace({'temperature':'[a-zA-Z]'},'',regex=True) # remove F , C
a=a.replace({'windspeed':'[a-zA-Z]'},'',regex=True) # remove mph
a

### Data Type


import numpy as np
df['temperature']=df.temperature.astype(np.float64)

FileNotFoundError: [Errno 2] No such file or directory: 'C:/Users/KunwarSunnySingh/Desktop/#Proj-Python/MLTutorial/dataset/weather_data.txt'

x = pd.DataFrame({'x': [1, 2, 3], 'y': [3, 4, 5]})
x.iloc[1] = {'x': 9, 'y': 99}